docs/taking-notes-in-vim.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-18 Thu 13:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Taking notes in Vim</title>
<meta name="author" content="Roger Farrell" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="template/styles.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Taking notes in Vim</h1>
<p>
Vim is a great platform for taking notes. However, some constraints are
necessary to maximize efficiency for real-time thought-capture.
</p>

<p>
<b>This note is a work in progress. It may be out-of-date or have
incomplete information.</b>
</p>
<div id="outline-container-current-solution" class="outline-2">
<h2 id="current-solution">Current solution</h2>
<div class="outline-text-2" id="text-current-solution">
</div>
<div id="outline-container-configure-vims-handling-of-markdown-files" class="outline-3">
<h3 id="configure-vims-handling-of-markdown-files">Configure Vim's handling of markdown files</h3>
<div class="outline-text-3" id="text-configure-vims-handling-of-markdown-files">
<p>
I have a file type plugin at <code>~/.vim/ftplugin/markdown.vim</code>. There are
several settings in that file that improve my workflow specifically for
taking markdown notes.
</p>
</div>
</div>
<div id="outline-container-markdown-syntax" class="outline-3">
<h3 id="markdown-syntax">Markdown syntax</h3>
<div class="outline-text-3" id="text-markdown-syntax">
<p>
Markdown is the de facto standard for note-taking, it lacks a single
definitive spec. Since Pandoc is the best tool for Markdown conversion,
I will be following the
<a href="https://pandoc.org/MANUAL.html#pandocs-markdown">Pandoc Markdown
spec</a>. If a fallback is required for further clarity, I will use
<a href="https://github.github.com/gfm">Github Flavored Markdown</a>.
</p>
</div>
</div>
<div id="outline-container-representing-keystrokes" class="outline-3">
<h3 id="representing-keystrokes">Representing keystrokes</h3>
<div class="outline-text-3" id="text-representing-keystrokes">
<p>
Since I spend a lot of time in the Vim help docs, I have decided to use
Vim's notation for keystrokes and special characters. In practice, this
means I am representing keystrokes using markdown inline code segments
instead of the HTML <code>&lt;kbd&gt;</code> tag. For more information about Vim's
notation syntax, see <code>:help notation</code>.
</p>
</div>
</div>
<div id="outline-container-links-instead-of-tags" class="outline-3">
<h3 id="links-instead-of-tags">Links instead of tags</h3>
<div class="outline-text-3" id="text-links-instead-of-tags">
<p>
The zettelkasten method prefers curated entry points to notes over
content searches. In the spirit of this convention, I have elected to
forgo querying by tags. Navigation will be handled entirely by links.
This has the added benefit of being fully supported by base Markdown
syntax.
</p>
</div>
</div>
<div id="outline-container-pandoc-for-online-viewing" class="outline-3">
<h3 id="pandoc-for-online-viewing">Pandoc for online viewing</h3>
<div class="outline-text-3" id="text-pandoc-for-online-viewing">
<p>
I am building my notes using Pandoc via a makefile. Currently, I am only
using one non-default Pandoc extension:
<a href="https://pandoc.org/MANUAL.html#extension-wikilinks_title_after_pipe">wikilinks<sub>title</sub><sub>after</sub><sub>pipe</sub></a>.
Wikilinks are simpler to write. I tried working with plain markdown
links, but they interrupted my flow-state.
</p>

<hr />
</div>
</div>
</div>
<div id="outline-container-previous-solutions" class="outline-2">
<h2 id="previous-solutions">Previous solutions</h2>
<div class="outline-text-2" id="text-previous-solutions">
</div>
<div id="outline-container-vim-help-docs" class="outline-3">
<h3 id="vim-help-docs">Vim help docs</h3>
<div class="outline-text-3" id="text-vim-help-docs">
<p>
Vim supports writing your own custom help docs in the VIMDOC format.
With some simple configuration, these can be accessed in exactly the
same way as the built-in Vim help.
</p>

<p>
Custom help docs should be added to <code>~/.vim/doc/</code>.
</p>

<p>
In order for Vim to read the help files, VIMDOCs begin and end with
special lines which contain metadata. The file must begin with a title
line in the below format,<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> and end with a modeline.<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
</p>

<div class="org-src-container">
<pre class="src src-vim">*filetitle.txt* {short description of the plugin}
</pre>
</div>
</div>
<div id="outline-container-configuring-vim" class="outline-4">
<h4 id="configuring-vim">Configuring Vim</h4>
<div class="outline-text-4" id="text-configuring-vim">
<p>
Some minimal configuration is required to enable custom VIMDOCS. The
following should be added to your <i>.vimrc</i>.
</p>

<div class="org-src-container">
<pre class="src src-vim">" USING VIM HELP DOCS FOR NOTES

" enables modelines in custom help files
" (This is overriding the default macOS config at /usr/share/vim/vimrc)
set modelines=1l

" regenerate help tags for personal notes on file save
autocmd BufWritePost ~/.vim/doc/* :helptags ~/.vim/doc
</pre>
</div>
</div>
</div>
<div id="outline-container-making-a-template" class="outline-4">
<h4 id="making-a-template">Making a template</h4>
<div class="outline-text-4" id="text-making-a-template">
<p>
To reduce overhead when creating new notes a template like the one below
is advisable. Note that I have set 'modifiable' and 'noreadonly' to
enable editing.
</p>

<div class="org-src-container">
<pre class="src src-vim">*n-template.txt*  Aliases: *n-tmp*  Created: YYYY-MM-DD


your text here


 vim:tw=78:ts=8:noet:ft=help:norl:modifiable:noreadonly:
</pre>
</div>
</div>
</div>
<div id="outline-container-writing-to-dos" class="outline-4">
<h4 id="writing-to-dos">Writing to dos</h4>
<div class="outline-text-4" id="text-writing-to-dos">
<p>
VIMDOC has a native syntax for to dos (see below). Note that real tabs
must be used for the syntax highlighting to work. If 'expandtabs' is
enabled, tabs can be inserted by typing <code>&lt;C-V&gt;</code> and then <code>&lt;Tab&gt;</code>. Also,
the to do title must begin with a lower case letter.
</p>

<div class="org-src-container">
<pre class="src src-vim">*Todo   your to do (starting with a lower case letter)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-vimwiki-plugin" class="outline-3">
<h3 id="vimwiki-plugin">Vimwiki plugin</h3>
<div class="outline-text-3" id="text-vimwiki-plugin">
<p>
I tested <a href="https://github.com/vimwiki">Vimwiki</a> for several months. It
extends Vim's note taking capability in many significant ways. Most
importantly, it reduces the mental overhead of note composition. Some
key features of Vimwiki include:
</p>

<ul class="org-ul">
<li>Excellent internal link navigation</li>
<li>Automatic not creation from links</li>
<li>Automatic global link updates upon file rename</li>
</ul>

<p>
Eventually, I managed to simplify my strategy sufficiently that the
efficiency gains were marginal.
</p>
</div>
</div>
<div id="outline-container-publishing-notes-with-mdwiki" class="outline-3">
<h3 id="publishing-notes-with-mdwiki">Publishing notes with MDwiki</h3>
<div class="outline-text-3" id="text-publishing-notes-with-mdwiki">
<p>
While using Vimwiki, I published my notes with
<a href="https://dynalon.github.io/mdwiki/">MDwiki</a>.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<code>:help help-writing</code>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<code>:help modeline</code>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Roger Farrell</p>
<p class="date">Created: 2025-09-18 Thu 13:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
